end-to-end/artillery/scenarios/assets.yml
config:
  target: "https://assets.stage.hubmapconsortium.org"
  phases:
    - duration: 5 # seconds
      arrivalRate: "{{ $processEnvironment.RATE }}" # scenarios started per second
  payload:
    path: "../payloads/generated-assets-ranges.csv"
    order: sequence
    fields:
      - size
      - range
      - path
  processor: "./helper.js"
scenarios:
  - flow:
      # Browser sends a pre-flight OPTIONS request for every byte-range GET request.
      # There are lots of headers, but going to hope they don't really matter for timing.
      - options:
          url: "{{ path }}"
          afterResponse: "printStatus"
      - get:
          url: "{{ path }}"
          headers:
            "Range": "bytes={{ range }}"
            "TE": "Trailers"
          gzip: true
          afterResponse: "printStatus"